# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [138]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [139]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [140]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [141]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [142]:
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [143]:
sum(city_data_df["type"]=="Urban")

66

In [144]:
sum(city_data_df["type"]=="Suburban")

36

In [145]:
sum(city_data_df["type"]=="Rural")

18

In [146]:
sum(city_data_df["driver_count"])

2973

In [147]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [148]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [149]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

### Merge the DataFrames

In [150]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [151]:
# Create Urban, Suburna, Rural DataFrames
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

In [152]:
urban_cities_df.count()

city            1625
date            1625
fare            1625
ride_id         1625
driver_count    1625
type            1625
dtype: int64

In [153]:
suburban_cities_df.count()

city            625
date            625
fare            625
ride_id         625
driver_count    625
type            625
dtype: int64

In [154]:
rural_cities_df.count()

city            125
date            125
fare            125
ride_id         125
driver_count    125
type            125
dtype: int64

In [210]:
city_type_names = pyber_data_df.groupby(["type"]).count()
city_type_names

          city  date  fare  ride_id  driver_count
type
Rural      125   125   125      125           125
Suburban   625   625   625      625           625
Urban     1625  1625  1625     1625          1625

In [155]:
urban_city = urban_cities_df.groupby(["type"]).count()
urban_city

       city  date  fare  ride_id  driver_count
type
Urban  1625  1625  1625     1625          1625

In [156]:
suburban_city = suburban_cities_df.groupby(["type"]).count()
suburban_city

          city  date  fare  ride_id  driver_count
type
Suburban   625   625   625      625           625

In [157]:
rural_city = rural_cities_df.groupby(["type"]).count()
rural_city

       city  date  fare  ride_id  driver_count
type
Rural   125   125   125      125           125

In [158]:
city_count = pyber_data_df.set_index(["city"])["type"]
city_count.count()

2375

In [188]:
city_type = pyber_data_df.groupby("type").count()
city_type

          city  date  fare  ride_id  driver_count
type
Rural      125   125   125      125           125
Suburban   625   625   625      625           625
Urban     1625  1625  1625     1625          1625

In [189]:
#  1. Get the total rides for each city type
urban_ride_count = urban_cities_df.groupby(["city"]).count()["ride_id"]
suburban_ride_count = suburban_cities_df.groupby(["city"]).count()["ride_id"]
rural_ride_count = rural_cities_df.groupby(["city"]).count()["ride_id"]

In [161]:
urban_ride_count.count()

66

In [162]:
suburban_ride_count.count()

36

In [163]:
rural_ride_count.count()

18

In [164]:
ride_count = pyber_data_df.set_index(["type"])["ride_id"]
ride_count.count()

2375

In [165]:
# 2. Get the total drivers for each city type
urban_driver_count = urban_cities_df.groupby(["city"]).count()["ride_id"]
suburban_driver_count = suburban_cities_df.groupby(["city"]).count()["ride_id"]
rural_driver_count = rural_cities_df.groupby(["city"]).count()["ride_id"]

In [166]:
urban_driver_count.sum()

1625

In [167]:
suburban_driver_count.sum()

625

In [168]:
rural_driver_count.sum()

125

In [169]:
# Get driver total
driver_count = (urban_driver_count.sum() + suburban_driver_count.sum() + rural_driver_count.sum())
driver_count.sum()

2375

In [170]:
#  3. Get the total amount of fares for each city type
urban_fare_count = urban_cities_df.groupby(["city"]).sum()["fare"]
suburban_fare_count = suburban_cities_df.groupby(["city"]).sum()["fare"]
rural_fare_count = rural_cities_df.groupby(["city"]).sum()["fare"]

In [171]:
urban_fare_count.sum()

39854.38000000001

In [172]:
suburban_fare_count.sum()

19356.33

In [173]:
rural_fare_count.sum()

4327.93

In [174]:
# Get fare total
fare_count = (urban_fare_count.sum() + suburban_fare_count.sum() + rural_fare_count.sum())
fare_count.sum()

63538.640000000014

In [175]:
urban_avg_fare = urban_cities_df.groupby(["city"]).mean()["fare"]
suburban_avg_fare = suburban_cities_df.groupby(["city"]).mean()["fare"]
rural_avg_fare = rural_cities_df.groupby(["city"]).mean()["fare"]

In [176]:
urban_avg_fare.sum()

1616.9420333079977

In [177]:
suburban_avg_fare.sum()

1106.5427292051343

In [178]:
rural_avg_fare.sum()

623.4797705627706

In [179]:
#  4. Get the average fare per ride for each city type. 
ride_percentage = 100 * pyber_data_df.groupby(["type"]).count()["ride_id"] / pyber_data_df["ride_id"].count()
ride_percentage

type
Rural        5.263158
Suburban    26.315789
Urban       68.421053
Name: ride_id, dtype: float64

In [180]:
# 5. Get the average fare per driver for each city type. 
driver_percentage = 100 * pyber_data_df.groupby(["type"]).sum()["fare"] / pyber_data_df["driver_count"].sum()
driver_percentage

type
Rural        6.298927
Suburban    28.171462
Urban       58.004599
Name: fare, dtype: float64

In [211]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.DataFrame(
    [{"Type": city_type_names,
        "Total Rides": ride_count,
        "Total Drivers": driver_count,
        "Total Fares": fare_count,
        "Average Fare Per Ride": ride_percentage,
        "Average Fare Per Driver": driver_percentage}])
pyber_summary_df

,Type,Total Rides,Total Drivers,Total Fares,Average Fare Per Ride,Average Fare Per Driver
0,city date fare ride_id driver_co...,type Urban 5739410935873 Urban 234391242...,2375,63538.64,type Rural 5.263158 Suburban 26.3157...,type Rural 6.298927 Suburban 28.1714...

In [212]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

pyber_summary_df.tail(3)

,Type,Total Rides,Total Drivers,Total Fares,Average Fare Per Ride,Average Fare Per Driver
0,city date fare ride_id driver_co...,type Urban 5739410935873 Urban 234391242...,2375,63538.64,type Rural 5.263158 Suburban 26.3157...,type Rural 6.298927 Suburban 28.1714...

In [213]:
#  8. Format the columns.
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,.2f}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,.2f}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare Per Ride"] = pyber_summary_df["Average Fare Per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare Per Driver"] = pyber_summary_df["Average Fare Per Driver"].map("${:,.2f}".format)

TypeError: unsupported format string passed to Series.__format__

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [214]:
# 1. Read the merged DataFrame
import numpy as np
import scipy.stats as sts

new_df = pyber_data_df.groupby(["type", "date"]).sum()[["fare"]]
new_df

                            fare
type  date
Rural 2019-01-01 09:45:36  43.69
      2019-01-02 11:18:32  52.12
      2019-01-03 19:51:01  19.90
      2019-01-04 03:31:26  24.88
      2019-01-06 07:38:40  47.33
...                          ...
Urban 2019-05-08 04:20:00  21.99
      2019-05-08 04:39:49  18.45
      2019-05-08 07:29:01  18.55
      2019-05-08 11:38:35  19.77
      2019-05-08 13:10:18  18.04

[2375 rows x 1 columns]

In [215]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
total_fares = pyber_data_df.groupby(["fare"])
total_fares.sum()

              ride_id  driver_count
fare
4.05    5344060775757            18
4.07    7909710246593            82
4.10   15099958819819           131
4.11    7676958819518            18
4.20    4817670763151            46
...               ...           ...
56.78   1253403506597             7
57.23   5081198789583             7
57.51   2301998876294             7
58.29    623154556195             1
58.55   8004803682564             9

[1841 rows x 2 columns]

In [216]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

new_df = pyber_data_df.groupby(["date", "type"]).sum()[["fare"]]
new_df

                               fare
date                type
2019-01-01 00:08:16 Urban     37.91
2019-01-01 00:46:46 Suburban  47.74
2019-01-01 02:07:24 Suburban  24.07
2019-01-01 03:46:50 Urban      7.57
2019-01-01 05:23:21 Urban     10.75
...                             ...
2019-05-08 04:20:00 Urban     21.99
2019-05-08 04:39:49 Urban     18.45
2019-05-08 07:29:01 Urban     18.55
2019-05-08 11:38:35 Urban     19.77
2019-05-08 13:10:18 Urban     18.04

[2375 rows x 1 columns]

In [217]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date
new_df = new_df.reset_index()
new_df

                     date      type   fare
0     2019-01-01 00:08:16     Urban  37.91
1     2019-01-01 00:46:46  Suburban  47.74
2     2019-01-01 02:07:24  Suburban  24.07
3     2019-01-01 03:46:50     Urban   7.57
4     2019-01-01 05:23:21     Urban  10.75
...                   ...       ...    ...
2370  2019-05-08 04:20:00     Urban  21.99
2371  2019-05-08 04:39:49     Urban  18.45
2372  2019-05-08 07:29:01     Urban  18.55
2373  2019-05-08 11:38:35     Urban  19.77
2374  2019-05-08 13:10:18     Urban  18.04

[2375 rows x 3 columns]

In [218]:
new_df_pivot = new_df.pivot(index="date", columns="type", values="fare")
new_df_pivot.head(10)

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [219]:
new_df_pivot_table = new_df.pivot_table(
     index="date",
    columns="type",
     values="fare").reset_index()
new_df_pivot_table

type                 date  Rural  Suburban  Urban
0     2019-01-01 00:08:16    NaN       NaN  37.91
1     2019-01-01 00:46:46    NaN     47.74    NaN
2     2019-01-01 02:07:24    NaN     24.07    NaN
3     2019-01-01 03:46:50    NaN       NaN   7.57
4     2019-01-01 05:23:21    NaN       NaN  10.75
...                   ...    ...       ...    ...
2370  2019-05-08 04:20:00    NaN       NaN  21.99
2371  2019-05-08 04:39:49    NaN       NaN  18.45
2372  2019-05-08 07:29:01    NaN       NaN  18.55
2373  2019-05-08 11:38:35    NaN       NaN  19.77
2374  2019-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 4 columns]

In [220]:
new_df_pivot = new_df.pivot(index="date", columns="type", values="fare")
new_df_pivot.head(10)

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [228]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
target_date_df = new_df_pivot_table.loc(new_df_pivot_table.date("2019-01-01":"2019-04-29")
target_date_df

SyntaxError: invalid syntax (<ipython-input-228-cd9f00267804>, line 2)

In [136]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)
target_date_df.index = pd.to_datetime(target_date_df.index)

NameError: name 'target_date_df' is not defined

In [137]:
# 7. Check that the datatype for the index is datetime using df.info()
target_date_df.info()

NameError: name 'target_date_df' is not defined

In [226]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
target_date_df_week = target_date_df_pivot.resample(w).sum()
target_date_df_week

NameError: name 'target_date_df_pivot' is not defined

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')